**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [0]:
import pandas as pd
import numpy as np
labels =  ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
data = pd.DataFrame({"birds":['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
                      'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 
                     'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 
                     'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}, index = labels)
# labels =  ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
data

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [0]:
data['birds'].describe()

count         10
unique         3
top       Cranes
freq           4
Name: birds, dtype: object

**3. Print the first 2 rows of the birds dataframe **

In [0]:
data['birds'].head(2)

a    Cranes
b    Cranes
Name: birds, dtype: object

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [0]:
data[['birds','age']]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [0]:
data.loc[['b', 'c', 'f'], ['birds', 'age', 'visits']]

     birds  age  visits
b   Cranes  4.0       4
c  plovers  1.5       3
f   Cranes  3.0       4

**6. select the rows where the number of visits is less than 4**

In [0]:
print(data.loc[data['visits']<4])

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [0]:
# ab = data.loc[data['age'].isnull()]
# ab
# options =  ['birds', 'visits']
# print(data.loc[data['age'].isnull().isin(options)])

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [0]:
print(data.loc[(data['age'] < 4) &
              (data['birds'] == "Cranes")])

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [0]:
print(data.loc[(data['age']>=2) & (data['age']<=4)])

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [0]:
print(data.loc[(data['birds']== "Cranes") , ['visits']].sum())

visits    12
dtype: int64

**11. Calculate the mean age for each different birds in dataframe.**

In [0]:
g = data.groupby('birds')
# for b, b_df in g:
#   print(b)
#   print(b_df['age'].mean())
print(g['age'].mean())

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [0]:
new_data = data.append({'birds': "Sparrow",
                        'age': "2",
                        'visits': "5",
                        'priority': "yes"}, ignore_index = True)
new_data

         birds  age visits priority
0       Cranes  3.5      2      yes
1       Cranes    4      4      yes
2      plovers  1.5      3       no
3   spoonbills  NaN      4      yes
4   spoonbills    6      3       no
5       Cranes    3      4       no
6      plovers  5.5      2       no
7       Cranes  NaN      2      yes
8   spoonbills    8      3       no
9   spoonbills    4      2       no
10     Sparrow    2      5      yes

**13. Find the number of each type of birds in dataframe (Counts)**

In [0]:
# print(data.pivot_table(index = ['birds'], aggfunc = 'size'))
print(data['birds'].value_counts())

Cranes        4
spoonbills    4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [0]:
df = data.sort_values(by = ['age'], ascending = False, na_position = 'last')
df = data.sort_values(by = ['visits'])
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
j  spoonbills  4.0       2       no
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
i  spoonbills  8.0       3       no
b      Cranes  4.0       4      yes
d  spoonbills  NaN       4      yes
f      Cranes  3.0       4       no

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [0]:
# data.replace({'priority': {'yes': 1, 'no': 0}})
# data
data['priority'] = data['priority'].map({'yes': 1, 'no': 0})
data

        birds  age  visits  priority
a      Cranes  3.5       2         1
b      Cranes  4.0       4         1
c     plovers  1.5       3         0
d  spoonbills  NaN       4         1
e  spoonbills  6.0       3         0
f      Cranes  3.0       4         0
g     plovers  5.5       2         0
h      Cranes  NaN       2         1
i  spoonbills  8.0       3         0
j  spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [0]:
# data.loc['Cranes', 'birds'] = 'trumpeters'
# data

AttributeError: ignored